/* Создать целочисленный массив из 10-ти чисел 
и вывести все чётные числа из массива */
// int[] arr3 = new int[10] { 7, 5, 12, 18, 16, 4, 88, 99, 3, 5 };
int[] arr3 = { 7, 5, 12, 18, 16, 4, 88, 99, 3, 5 };
int s = 0;

while (s < arr3.Length)
{
    if (arr3[s] % 2 == 0)
        Console.Write($"{arr3[s]} ");
    s = s + 1;
}
