/*
Задача 2: Задайте массив на 10 целых чисел.
Напишите программу, которая определяет
количество чётных чисел в массиве.
[6 7 19 34 3 1 4 7 9 1] => 3
[1 8 43 4 55 60 3 2 1 3] => 4
*/

int[] array = { 1, 8, 43, 4, 55, 60, 3, 2, 1, 3 };
int even = 0;
foreach (var item in array)
{
    if (item % 2 == 0)
    {
        even++;
    }
}
Console.Write(even);