/*
Задача 1: Задайте одномерный массив из 10 целых
чисел от 1 до 100. Найдите количество элементов
массива, значения которых лежат в отрезке [10,90].
[10 21 14 93 23 100 4] => 4
*/

int[] array = { 1, 21, 0, 93, 23, 100, 4, 8, 10, 90 };
int count = 0;
for (int i = 0; i < array.Length; i++)
{
    if (array[i] >= 10 & array[i] <= 90)
    {
        count++;
    }
}
Console.Write(count);